Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: SendMessage and PostMessage now require wParam and lParam to be integers or objects with a Ptr property; an exception is thrown if they are given a non-numeric string or float.
ja: SendMessageとPostMessageでは、wParamとlParamが整数またはPtrプロパティを持つオブジェクトである必要があります。

source: SendMessage timeout is usually an anomolous condition, so causes a TimeoutError to be thrown.
ja: SendMessageのタイムアウトは通常異常な状態であるため、TimeoutErrorが投げられる。

source: SendMessage works the same way but additionally waits for a return value, which can be used for things such as getting the currently playing track in Winamp (see Automating Winamp for an example).
ja: SendMessageも同じように動作するが、さらに戻り値を待つ。この戻り値は、Winampで現在再生中のトラックを取得する場合などに使用できる（例としてWinampの自動化を参照）。

source: SendMessage, Message List, Message Tutorial, OnMessage, Automating Winamp, DllCall, ControlSend, MenuSelect
ja: SendMessage、メッセージリスト、メッセージチュートリアル、OnMessage、Winampの自動化、DllCall、ControlSend、MenuSelect

source: SendMode defaults to Input instead of Event.
ja: SendModeのデフォルトは、Event ではなく Input です。

source: SendMode, SetKeyDelay, SetStoreCapsLockMode, Escape sequences (e.g. `n), ControlSend, BlockInput, Hotstrings, WinActivate
ja: SendMode、SetKeyDelay、SetStoreCapsLockMode、エスケープシーケンス（例：`n）、ControlSend、BlockInput、ホットストリング、WinActivate

source: SendPlay is not affected by SendLevel.
ja: SendPlayはSendLevelの影響を受けません。

source: SendText is best for sending text verbatim, but it can't send keys that don't produce text, like Left or Home.
ja: SendTextはテキストをそのまま送信するのに適していますが、Leftや Homeのようなテキストを生成しないキーは送信できません。

source: SendText, equivalent to SendRaw but using Text mode instead of Raw mode.
ja: SendRawと同等ですが、RawモードではなくTextモードを使用するSendTextです。

source: SendText, equivalent to SendRaw but using {Text} mode instead of {Raw} mode.
ja: SendRawと同等ですが、{Raw}モードではなく{Text}モードを使用するSendTextです。

source: Sent keystrokes are ignored if the send level of the keystroke is below the InputHook's MinSendLevel.
ja: 送信されたキーストロークの送信レベルがInputHookのMinSendLevel以下の場合、送信されたキーストロークは無視されます。

source: Set: Sets a miscellaneous property.
ja: Set：雑多なプロパティを設定する。

source: Set: Sets zero or more items.
ja: Set：0個以上の項目を設定する。

source: SetProp: Sets an .exe property.
ja: SetProp：.exe プロパティを設定します。

source: SetColor: Changes the background color of the menu.
ja: SetColor：メニューの背景色を変更します。

source: SetControlDelay, Control functions, Click
ja: SetControlDelay、Control関数、Click

source: SetControlDelay, ControlGetFocus, Control functions
ja: SetControlDelay、ControlGetFocus、Control関数

source: SetControlDelay, ControlGetText, Control functions
ja: SetControlDelay、ControlGetText、Control関数

source: SetControlDelay, Win functions, GuiControl object (for controls created by the script)
ja: SetControlDelay、Win関数、GuiControlオブジェクト（スクリプトで作成したコントロール用）

source: SetFont: Sets the font typeface, size, style, and/or color for the control.
ja: SetFont：コントロールのフォントの書体、サイズ、スタイル、色などを設定します。

source: SetFont: Sets the typeface, size, style, and text color for subsequently created controls.
ja: SetFont：続いて作成されるコントロールの書体、サイズ、スタイル、テキストカラーを設定します。

source: SetIcon: Sets the icon to be displayed next to a menu item.
ja: SetIcon：メニュー項目の横に表示するアイコンを設定します。

source: SetImageList: Sets or replaces an ImageList for displaying icons.
ja: SetImageList：アイコンを表示するための ImageList を設定または置き換える。

source: SetKeyDelay exists for the second case.
ja: SetKeyDelay 2番目のケースに存在します。

source: SetKeyDelay, Escape sequences (e.g. `n) , Control functions, Send, Automating Winamp
ja: SetKeyDelay、エスケープシーケンス（例：`n）、Control関数、Send、Winampの自動化

source: SetMainIcon: Sets the main icon.
ja: SetMainIcon：メインアイコンを設定する。

source: SetStoreCapsLockMode is ignored; that is, the state of CapsLock is not changed.
ja: SetStoreCapsLockModeは無視され、すなわちCapsLockの状態は変更されない。

source: SetTimer no longer supports label or function names, but as it now accepts an expression and functions can be referenced directly by name, usage looks very similar:
ja: SetTimerはラベル名や関数名をサポートしなくなりましたが、式が使えるようになり、関数は名前で直接参照できるようになったので、使い方は非常に似ています：

source: SetTimer no longer supports label or function names, but as it now accepts an expression and functions can be referenced directly by name, usage looks very similar: SetTimer MyFunc.
ja: SetTimerはラベル名や関数名をサポートしなくなりましたが、式が使えるようになり、関数は名前で直接参照できるようになったので、使い方は非常に似ています：SetTimer MyFunc。

source: SetTitleMatchMode can be used to make functions expect a prefix, exact match, or RegEx pattern instead.
ja: SetTitleMatchModeを使用すると、関数の代わりにプレフィックス、完全一致、またはRegExパターンを期待するようにすることができます。

source: SetTitleMatchMode controls how a partial or complete title is compared against the title of each window.
ja: SetTitleMatchModeは、部分的または完全なタイトルを各ウィンドウのタイトルと比較する方法を制御します。

source: SetWinDelay does not apply to this function.
ja: SetWinDelayは、この関数には適用されません。

source: SetWinDelay, Control functions, Gui object (for windows created by the script)
ja: SetWinDelay、Control関数、Guiオブジェクト（スクリプトによって作成されたウィンドウ）

source: SetWorkingDir and A_WorkingDir support long paths only when Windows 10 long path awareness is enabled, since the \\?\ prefix cannot be used.
ja: SetWorkingDirと A_WorkingDirは、\\?\接頭辞が使用できないため、Windows 10のロング・パス認識が有効な場合にのみロング・パスに対応します。

source: Show: Displays the menu.
ja: Show：メニューを表示します。

source: Show: Displays the window.
ja: Show：ウィンドウを表示します。

source: Sin: Returns the trigonometric sine of a number.
ja: Sin：TrionometricSine関数は、数値の正弦を返します。

source: Size: Retrieves or sets the buffer's size, in bytes.
ja: Size：バッファのサイズをバイト単位で取得または設定します。

source: Size: The size, in bytes, of the raw binary data.
ja: Size：未加工のバイナリデータのサイズ（バイト単位）です。

source: Sort has received the following changes:
ja: Sortは、以下の変更を受けました：

source: Sort with the U option no longer returns the number of duplicates removed.
ja: Uオプションによるソートで、重複を除去した数を返さないようになりました。

source: Sound Functions, DeviceTopology API
ja: Sound関数、DeviceTopology API

source: Sound functions:
ja: サウンド機能：

source: Sound functions: SoundGet and SoundSet have been revised to better match the capabilities of the Vista+ sound APIs, dropping support for XP.
ja: Sound関数：SoundGetとSoundSetは、Vista+のサウンドAPIの機能によりマッチするように改訂され、XPのサポートを取りやめました。

source: SoundBeep, Sound Functions, MsgBox, Threads
ja: SoundBeep、Sound関数、MsgBox、スレッド

source: SoundPlay (for this, the limit is 127 characters)
ja: SoundPlay（この場合は127文字まで）

source: Splitting a Long Line into a Series of Shorter Ones:
ja: 長い線を短い線に分割する：

source: Splitting a Long Line into a Series of Shorter Ones: This can improve a script's readability and maintainability.
ja: 長い線を短い線に分割する：これにより、スクリプトの可読性と保守性が向上する。

source: Sqrt: Returns the square root of a number.
ja: Sqrt：数値の平方根を返します。

source: Start: Starts collecting input.
ja: Start：入力の収集を開始します。

source: Statements are grouped together into a block by enclosing them in braces {}, as in C, JavaScript and similar languages, but usually the braces must appear at the start of a line.
ja: ステートメントは、グループ化され ブロックは、C言語やJavaScriptなどのように中括弧{}で囲むことで実現できますが、通常、中括弧は行頭に表示する必要があります。

source: Static Methods:
ja: 静的メソッドです：

source: Static variables for the current function.
ja: 現在の関数の静的変数です。

source: StatusBar: The part number of the clicked section (however, the part number might be a very large integer if the user clicks near the sizing grip at the right side of the bar).
ja: StatusBar：クリックした部分の品番（ただし、バー右側のサイズグリップ付近をクリックした場合、品番は非常に大きな整数になる可能性があります）。

source: Stop: Terminates the Input and sets EndReason to the word Stopped.
ja: Stop：入力を終了し、EndReason に Stopped という単語を設定します。

source: StrGet/StrPut: The Address parameter can be an object with the Ptr and Size properties, such as the new Buffer object.
ja: StrGet/StrPut：Addressパラメータには、新しいBufferオブジェクトのようなPtrと Sizeプロパティを持つオブジェクトを指定することができます。

source: StrGet: If Length is negative, its absolute value indicates the exact number of characters to convert, including any binary zeros that the string might contain - in other words, the result is always a string of exactly that length.
ja: StrGet：Lengthが負の場合、その絶対値は、文字列が含むかもしれない2進数のゼロを含む、変換する正確な文字数を示します。言い換えれば、結果は常に正確にその長さの文字列になります。

source: StrLower and StrTitle
ja: StrLowerとStrTitle

source: StrReplace now has a CaseSense parameter in place of OutputVarCount, which is moved one parameter to the right, with Limit following it.
ja: StrReplaceでは、OutputVarCountの代わりにCaseSenseパラメータが追加され、パラメータが1つ右に移動し、Limitがそれに続いています。

source: StrSplit or a parsing loop is often used inside a file-reading loop to parse the contents of each line retrieved from InputFile.
ja: StrSplitや 構文解析ループは、ファイル読み込みループの中で、InputFileから取得した各行の内容を構文解析するためによく使われます。

source: StrSplit, file-reading loop, Loop, Break, Continue, Blocks, Sort, FileSetAttrib, FileSetTime
ja: StrSplit、ファイル読み込みループ、Loop、Break、Continue、ブロック、Sort、FileSetAttrib、FileSetTime

source: StrUpper and StrTitle
ja: StrUpperとStrTitle

source: String Encoding, StrGet, Binary Compatibility, FileEncoding, DllCall, Buffer object, VarSetStrCapacity
ja: 文字列のエンコード、StrGet、バイナリ互換性、FileEncoding、DllCall、Bufferオブジェクト、VarSetStrCapacity

source: String Encoding, StrPut, Binary Compatibility, FileEncoding, DllCall, Buffer object, VarSetStrCapacity
ja: 文字列のエンコード、StrPut、バイナリ互換性、FileEncoding、DllCall、Bufferオブジェクト、VarSetStrCapacity

source: String
ja: 文字列

source: String or Array
ja: 文字列または配列

source: String or Array of Strings
ja: 文字列または文字列の配列

source: String or Buffer
ja: 文字列またはバッファ

source: String or Function Object
ja: 文字列または関数オブジェクト

source: String or Integer (boolean)
ja: 文字列 or 整数（ブーリアン）

source: String or Integer
ja: 文字列または整数

source: String or Object
ja: 文字列またはオブジェクト

source: String, Integer or Float
ja: 文字列、整数、浮動小数点

source: String, Integer or Object
ja: 文字列、整数またはオブジェクト

source: String: Check whether a string matches a specific pattern.
ja: String：文字列が指定したパターンに一致するかをチェックします。

source: Strings (text)
ja: 文字列（テキスト）

source: Submit: Collects the values from named controls and composes them into an Object.
ja: Submit：名前付きコントロールから値を収集し、オブジェクトに合成します。

source: Suspend, Hotkeys, Hotstrings
ja: Suspend、ホットキー、ホットストリング

source: Suspend, Menu object, ExitApp, Threads, SetTimer
ja: Suspend、Menuオブジェクト、ExitApp、スレッド、SetTimer

source: Suspend: Making a hotkey or hotstring's first line a call to Suspend no longer automatically makes it exempt from suspension.
ja: Suspend：ホットキーやホットストリングの最初の行をSuspendの呼び出しにすることで、自動的にSuspendが免除されるようになることはなくなりました。

source: Switch compares a value with multiple cases and executes the statements of the first match.
ja: Switchは、値を複数のケースと比較し、最初にマッチしたステートメントを実行します。

source: Switch executes one case from a list of mutually exclusive candidates.
ja: Switchは、相互に排他的な候補のリストから1つのケースを実行します。

source: Switch now performs case-sensitive comparison for strings by default, and has a CaseSense parameter which overrides the mode of case sensitivity and forces string (rather than numeric) comparison.
ja: Switchは、デフォルトで文字列の大文字小文字を区別して比較するようになりました。また、大文字小文字を区別するモードを上書きし、（数値ではなく）文字列の比較を強制するCaseSenseパラメータがあります。

source: SysGet can be used to retrieve the bounding rectangle of all display monitors.
ja: SysGetを使用すると、すべてのディスプレイモニターの外接矩形を取得することができます。

source: SysGet now only has numeric sub-commands; its other sub-commands have been split into functions.
ja: SysGetのサブコマンドは数値のみとなり、その他のサブコマンドは関数に分割されました。

source: SysGet, Monitor functions
ja: SysGet、Monitor関数

source: System verbs are actions that the system or applications register for specific file types.
ja: システム動詞とは、システムやアプリケーションが特定のファイルタイプに対して登録するアクションのことです。

source: Tan: Returns the trigonometric tangent of a number.
ja: Tan：TrionometricTangent関数は、数値の三角形の正接を返します。

source: TargetError: The target control could not be found and Control-or-Pos does not specify a valid position.
ja: TargetError：対象コントロールが見つからず、Control-or-Posで有効な位置が指定されていない。

source: TargetError: The target window could not be found.
ja: TargetError：対象のウィンドウが見つかりませんでした。

source: TargetError: The target window or control could not be found.
ja: TargetError：対象のウィンドウまたはコントロールが見つかりませんでした。

source: Text: Retrieves or sets the text/caption of the control.
ja: Text：コントロールのテキスト/キャプションを取得または設定します。

source: That’s not very Smart of you, Microsoft
ja: マイクロソフトのスマートさには負けますが

source: The WinTitle Parameter, SetWinDelay, WinExist, WinActivate, RegExMatch
ja: WinTitleパラメータ、SetWinDelay、WinExist、WinActivate、RegExMatch

source: ThisHotkey, A_ThisHotkey and A_TimeSinceThisHotkey are set based on the hotkey for which the current #HotIf expression is being evaluated.
ja: ThisHotkey、A_ThisHotkey、A_TimeSinceThisHotkeyは、現在の#HotIf式が評価されているホットキーに基づき設定されます。

source: Thread (function), Threads, #MaxThreadsPerHotkey, #MaxThreadsBuffer, OnMessage, CallbackCreate, Hotkey, Menu object, SetTimer
ja: Thread（関数）、スレッド、#MaxThreadsPerHotkey、#MaxThreadsBuffer、OnMessage、CallbackCreate、Hotkey、Menuオブジェクト、SetTimer

source: Thread NoTimers is similar to Critical except that it only prevents interruptions from timers.
ja: Thread NoTimersは、タイマーからの割り込みを防ぐだけで、Criticalと似ています。

source: Threads start out with an uninterruptible timeout of 17ms instead of 15ms.
ja: スレッドは、15msの代わりに17msの無停止タイムアウトで開始されます。

source: Threads start out with an uninterruptible timeout of 17 ms instead of 15 ms.
ja: スレッドは、15ミリ秒ではなく17ミリ秒の中断不能タイムアウトで始まります。

source: Threads, Thread (function), Critical, Function Objects
ja: スレッド、Thread（関数）、Critical、関数オブジェクト

source: Throw throws an exception to be handled by try/catch or OnError, or to display an error dialog.
ja: Throw try/catch やOnErrorで処理される例外を、エラーダイアログを表示するためのものです。

source: Throw, Catch, Else, Finally, Blocks, OnError
ja: Throw、Catch、Else、Finally、ブロック、OnError

source: Timeout: Retrieves or sets the timeout value in seconds.
ja: Timeout：タイムアウト値を秒単位で取得または設定します。

source: Title matching mode defaults to 2 instead of 1.
ja: タイトルマッチングモードのデフォルトは、1ではなく2です。

source: ToggleCheck: Toggles the checkmark next to a menu item.
ja: ToggleCheck：メニューの横にあるチェックマークを切り替えます。

source: ToggleEnable: Enables or disables a menu item.
ja: ToggleEnable：メニュー項目の有効／無効を設定します。

source: ToolTip, SetTimer, Menu object, MsgBox, InputBox, FileSelect, DirSelect
ja: ToolTip、SetTimer、Menuオブジェクト、MsgBox、InputBox、FileSelect、DirSelect

source: Tray Icon, TraySetIcon, A_IconHidden, A_IconTip, ExitApp
ja: トレイアイコン、TraySetIcon、A_IconHidden、A_IconTip、ExitApp

source: Tray menu:
ja: トレイメニュー：

source: Tray menu: The word "This" was removed from "Reload This Script" and "Edit This Script", for consistency with "Pause Script" and the main window's menu options.
ja: トレイメニュー：「Pause Script」やメインウィンドウのメニューオプションとの整合性をとるため、「Reload This Script」「Edit This Script」から「This」という単語を削除しました。

source: TraySetIcon can be used to change the icon.
ja: TraySetIconは、アイコンを変更するために使用することができます。

source: TraySetIcon or Menu.SetIcon
ja: TraySetIconまたはMenu.SetIcon

source: TrayTip's usage has changed to TrayTip [Text, Title, Options].
ja: TrayTipの使い方が、TrayTip [Text, Title, Options]に変更になりました。

source: TreeView, Other Control Types, Gui(), ContextMenu event, Gui object, GuiControl object, ListView styles table
ja: TreeView、その他のコントロールタイプ、Gui()、ContextMenuイベント、Guiオブジェクト、GuiControlオブジェクト、ListViewのスタイルの表

source: TreeView: The ID of the clicked item, or 0 if the mouse was not over an item.
ja: TreeView：クリックされた項目のID、またはマウスが項目上にない場合は0を指定します。

source: Trigonometry:
ja: 三角法：

source: Try guards its body against runtime errors and values thrown by the throw statement.
ja: Try、実行時のエラーやthrow文によって投げられる値に対して本体をガードします。

source: Try, Catch, Else, Throw, Blocks
ja: Try、Catch、Else、Throw、ブロック

source: Try, Throw, Error Object, Else, Finally, Blocks, OnError
ja: Try、Throw、Errorオブジェクト、Else、Finally、ブロック、OnError

source: Try-Catch can be used to test for the existence of a hotkey variant.
ja: Try-Catch は、ホットキーのバリアントが存在するかどうかをテストするために使用することができます。

source: Type, Float, Integer, String, Values, Expressions, Is functions
ja: Type、Float、Integer、String、値、式、Is関数

source: Type, Float, Number, String, Values, Expressions, Is functions
ja: Type、Float、Number、String、値、式、Is関数

source: Type, Integer, Float, Values, Expressions, Is functions
ja: Type、Integer、Float、値、式、Is関数

source: Type, Integer, Number, String, Values, Expressions, Is functions
ja: Type、Integer、Number、String、値、式、Is関数

source: Type: Check the type of a value, or whether a string can be interpreted as a value of that type.
ja: Type：値の型、または文字列がその型の値として解釈できるかどうかを確認します。

source: Type: Retrieves the type of the control.
ja: Type：コントロールの種類を取得します。

source: TypeError: An argument was passed a value of an unexpected type.
ja: TypeError：引数に予期せぬ型の値が渡された。

source: TypeError: The [DllFile\]Function parameter is a floating point number.
ja: TypeError：[DllFile\]Functionパラメータは、浮動小数点数です。

source: Uncheck: Removes the checkmark (if there is one) from a menu item.
ja: Uncheck：メニュー項目からチェックマーク（ある場合）を削除します。

source: Until causes a loop to terminate when an expression evaluates to true.
ja: Untilは、式がtrueと評価されたときにループを終了させる。

source: Until, Break, Continue, Blocks, Loop, For-loop, Files-and-folders loop, Registry loop, File-reading loop, Parsing loop, If
ja: Until、Break、Continue、ブロック、Loop、Forループ、ファイルループ、レジストリループ、ファイル読み込みループ、解析ループ、If

source: Until, While-loop, For-loop, Files-and-folders loop, Registry loop, File-reading loop, Parsing loop, Break, Continue, Blocks, Else
ja: Until、Whileループ、Forループ、ファイルループ、レジストリループ、ファイル読み込みループ、解析ループ、Break、Continue、ブロック、Else

source: UpdateManifest: Changes the .exe's manifest.
ja: UpdateManifest：.exe のマニフェストを変更します。

source: UseResourceLang: Changes the resource language.
ja: UseResourceLang：リソースの言語を変更する。

source: Using the Program covers the basics of how to use AutoHotkey.
ja: プログラムの使い方では、AutoHotkeyの使い方の基本を解説しています。

source: Using the Program:
ja: プログラムの使用

source: Using the Program: How to use AutoHotkey, in general.
ja: プログラムの使用：AutoHotkeyの一般的な使い方。

source: ValueError or TypeError:
ja: ValueError または TypeError：

source: ValueError or TypeError: Invalid parameters were detected.
ja: ValueError または TypeError：無効なパラメータが検出されました。

source: ValueError: The return type or one of the specified arg types is invalid.
ja: ValueError：戻り値の型、または指定されたargの型のいずれかが無効です。

source: Values, Expressions, Is functions, Integer, Float, String
ja: 値、式、Is関数、Integer、Float、String

source: VarSetStrCapacity, DllCall, SendMessage, Buffer object, NumPut, NumGet
ja: VarSetStrCapacity、DllCall、SendMessage、Bufferオブジェクト、NumPut、NumGet

source: Variable Capacity and Memory:
ja: 可変容量・メモリ。

source: Variable Capacity and Memory: details about limitations.
ja: 可変容量・メモリ：制限事項の詳細はこちら。

source: Variable
ja: 変数

source: Variables are like little post-it notes that hold some information.
ja: 変数は、ある情報を保持する小さな付箋のようなものだ。

source: Variables:
ja: 変数：

source: Variables: basic usage and examples.
ja: 変数：基本的な使い方と例。

source: Variadic function call.
ja: 変数関数呼び出し。

source: Variadic function calls now permit any enumerable object, where previously they required a standard Object with sequential numeric keys.
ja: 従来は数値キーが連続する標準的なオブジェクトが必要でしたが、可変長引数関数の呼び出しでは、列挙可能なオブジェクトが使用できるようになりました。

source: Variadic functions are not affected by the above restriction, but normally will create an array each time they are called to hold the surplus parameters.
ja: 可変長引数関数は上記の制限の影響を受けませんが、通常、呼び出されるたびに配列を作成し、剰余パラメータを保持します。

source: VisibleNonText: Controls whether keys or key combinations which do not produce text are visible (not blocked).
ja: VisibleNonText：テキストを生成しないキーまたはキーの組み合わせを表示するかどうかを制御します（ブロックされません）。

source: VisibleText or VisibleNonText is consulted, depending on whether the key produces text.
ja: キーがテキストを生成するかどうかに応じて、VisibleTextまたはVisibleNonTextが参照されます。

source: VisibleText: Controls whether keys or key combinations which produce text are visible (not blocked).
ja: VisibleText：テキストを生成するキーまたはキーの組み合わせを表示するかどうかを制御します（ブロックされません）。

source: Wait: Waits until the Input is terminated (InProgress is false).
ja: Wait：Inputが終了するまで待機します（InProgressがfalse）。

source: While executes a statement repeatedly until the specified expression evaluates to false.
ja: Whileは、指定された式がfalseに評価されるまで、ステートメントを繰り返し実行します。

source: Wikipedia
ja: ウィキペディア

source: Win functions, Control functions
ja: Win関数、Control関数

source: Win32 Menus, Menu/MenuBar object, Menu.Handle, Menu()
ja: Win32メニュー、Menu/MenuBarオブジェクト、Menu.Handle、Menu()

source: WinActivate now sends {Alt up} after its first failed attempt at activating a window.
ja: WinActivateは、ウィンドウのアクティブ化に初めて失敗した後、{Alt up}を送信するようになりました。

source: WinActivateBottom activates the bottommost matching window (typically the one least recently used).
ja: WinActivateBottomは、一番下のマッチするウィンドウをアクティブにする（通常、一番最近使われたウィンドウ）。

source: WinActivateBottom, #WinActivateForce, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, WinExist, WinActive, WinWaitActive, WinWait, WinWaitClose, WinClose, GroupActivate, Win functions
ja: WinActivateBottom、#WinActivateForce、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、WinExist、WinActive、WinWaitActive、WinWait、WinWaitClose、WinClose、GroupActivate、Win関数

source: WinActive, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, ProcessExist, WinActivate, WinWaitActive, WinWait, WinWaitClose, #HotIf
ja: WinActive、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、ProcessExist、WinActivate、WinWaitActive、WinWait、WinWaitClose、#HotIf

source: WinClose and WinKill: For SecondsToWait, specifying 0 is no longer the same as specifying 0.5; instead, it produces the shortest wait possible.
ja: WinClose、WinKill：SecondsToWaitについては、0を指定しても0.5を指定したのと同じではなく、可能な限り短い待ち時間を生成するようになりました。

source: WinClose, WinWaitClose, ProcessClose, WinActivate, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, WinExist, WinActive, WinWaitActive, WinWait, GroupActivate
ja: WinClose、WinWaitClose、ProcessClose、WinActivate、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、WinExist、WinActive、WinWaitActive、WinWait、GroupActivate

source: WinExist, SetTitleMatchMode, DetectHiddenWindows, Last Found Window, WinActivate, WinWaitActive, WinWait, WinWaitClose, #HotIf
ja: WinExist、SetTitleMatchMode、DetectHiddenWindows、ラストファウンドウィンドウ、WinActivate、WinWaitActive、WinWait、WinWaitClose、#HotIf

source: WinGetClass, WinGetControls, ClassNN property (GuiControl object), MouseGetPos, Control functions
ja: WinGetClass、WinGetControls、ClassNNプロパティ（GuiControlオブジェクト）、MouseGetPos、Control関数

source: WinGetControls, Win functions, Control functions
ja: WinGetControls、Win関数、Control関数

source: WinGetControlsHwnd (within the Array)
ja: WinGetControlsHwnd(配列内)

source: WinGetControlsHwnd, Win functions, Control functions
ja: WinGetControlsHwnd、Win関数、Control関数

source: WinGetCount, Win functions, Control functions
ja: WinGetCount、Win関数、Control関数

source: WinGetID, ControlGetHwnd, Hwnd property (Gui object), Win functions, Control functions
ja: WinGetID、ControlGetHwnd、Hwndプロパティ（Guiオブジェクト）、Win関数、Control関数

source: WinGetID, Hwnd property (GuiControl object), Control functions
ja: WinGetID、Hwndプロパティ（GuiControlオブジェクト）、Control関数

source: WinGetIDLast, ControlGetHwnd, Hwnd property (Gui object), Win functions, Control functions
ja: WinGetIDLast、ControlGetHwnd、Hwndプロパティ（Guiオブジェクト）、Win関数、Control関数

source: WinGetList (within the Array)
ja: WinGetList(配列内)

source: WinGetList, Win functions, Control functions
ja: WinGetList、Win関数、Control関数

source: WinGetList, WinGetControls and WinGetControlsHwnd return arrays, not newline-delimited lists.
ja: WinGetList、WinGetControls、WinGetControlsHwndは、改行で区切られたリストではなく、配列を返します。

source: WinGetPID, WinGetProcessName, Process functions, Win functions, Control functions
ja: WinGetPID、WinGetProcessName、Process関数、Win関数、Control関数

source: WinGetPID, WinGetProcessPath, Process functions, Win functions, Control functions
ja: WinGetPID、WinGetProcessPath、Process関数、Win関数、Control関数

source: WinGetProcessName (this theoretically isn't a problem since it is applied only to the name portion, and NTFS only supports names up to 255 chars).
ja: WinGetProcessName（これは名前部分にのみ適用され、NTFSは255文字までの名前しかサポートしないので、理論的には問題ない）。

source: WinGetProcessName, WinGetProcessPath, Process functions, Win functions, Control functions
ja: WinGetProcessName、WinGetProcessPath、Process関数、Win関数、Control関数
